[
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "Granted it's good, and I like most of PTA's films, but it's not like this is anywhere near as brilliant as something like There Will Be Blood or The Master. The plot is very simple, and while that's not a bad thing, I found it difficult finding anything substantial to grab onto. The performances are certainly good but again it feels like all the actors with the exception of probably Chase Infiniti and maybe Sean Penn aren't given a whole lot to do. In my opinion this was far less interestingly photographed than something like Phantom Thread, and with less compelling characters than something like The Master, and lacked the spectacle and gravitas of something like There Will Be Blood. Still better than most films releasing these days, but if you're looking at all the rave reviews like I was and expecting a masterpiece, from my perspective I'd be lowering my expectations. It gets a 7/10 for being well performed and pretty well written, but I can't go beyond that because it lacked the depth I'd normally be seeking from filmmakers of PTA's caliber.",
  "rating": 7,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "Incredible starcast that shines throughout. Creative camera work including the one where it is attached to the bumper of the ride to show you how the state of affairs really is. Delicate subject handled carefully, this one is all adrenalin! Di Caprio's role is similar to the one in Once Upon a Time in Hollywood as he appears to be a hapless man, struggling often to comical tones, Sean Penn as the Colonel plays his part earnestly but it is finally Benicio who shines in a short but a part that stays with long after the credits roll over.",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "I was honestly pleasantly surprised by One Battle After Another. It's one of those films that presents itself as one genre before the film releases, but you definitely get more out of it in terms of what kind of film it is. It's an hilarious thrill ride that sort of overtakes the drama by giving us silly characters and scenarios that are absolutely effective in the storytelling. Paul Thomas Anderson certainly does an exceptional job directing this one and his ambition with the project looked very high coming from the picture. For me, the acting was truly one of the best aspects of the film. The acting, particularly from our main talents, are responsible for that inclusion of balance between the comedy and the drama. There are multiple times in which you'll find out that some of the characters are just completely dumb and it's just a lot of fun. The cinematography is actually interesting because of the use of VistaVision. I thought the picture looked absolutely great with it, especially during the climax. Jonny Greenwood's music is fantastic, the editing is super clean, and the adapted screenplay by PTA is absolutely consistent. One Battle After Another is surely a great film to see on the big screen and I highly recommend it. I also wouldn't be surprised at all if it was nominated for one of the best films of 2025. It's that entertaining.",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "Stop reading the reviews and just go see the film. Even if it's not what everyone has hyped it up to be, it's still well worth watching. The actors are great, and the cinematography is excellent. It also has some good music in it. So even if you don't walk away thinking it's the best film of 2025, you'll still have watched a decent film.",
  "rating": 10,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "So, when I went to the cinema, I didn't know what to expect. For many people, it was either a 10/10 or a 0/10 film, but the strangest thing was that I knew absolutely nothing about the plot! At the beginning of the film, it felt overwhelming. It seemed rushed and poorly made, like an amateur video shot by a bunch of drunk guys, and it was full of sexual scenes that I honestly didn't understand. As the film went on, though, the story became more serious, the main character started to take shape and develop a stronger personality, and overall, the movie became more enjoyable. The plot shifts from a political drama to a family drama, and in my opinion, there are also some hidden critiques of the current American government... but nothing certain. The colonel character is fantastic-Sean Penn gives an Oscar-worthy performance (and I think he'll win it). He manages to convey fear and authority, and the director clearly uses him as part of a broader critique. In some moments, he even reminded me of No Country for Old Men, even though the two antagonists are very different. DiCaprio is good, but not Oscar-worthy in my opinion. The part he drew from The Big Lebowski was convincing, but I think he's been better in other films, like Django Unchained. Still, he manages to be both entertaining and serious. One thing I didn't like was the use of a handheld camera in some scenes-thank God they didn't shoot the whole film like that, or it would've been a huge shame. Also, some scenes could've done without the constant soundtrack, although in other moments the music works very well. Overall, the film is really good, with a cast that delivers (except for Perfidia), and a plot that's quite deep but eventually explains itself clearly. Do I agree with those calling it the film of the year? Yes, absolutely-for what has been released so far, it's definitely up there, though it does have some strong competition. Watch it-you won't regret it, but pay attention!",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "The story wasn't very elaborate but the character development was excellent. I don't want to get into any political messaging because there is some in the movie (1st 10 mins had me skeptical) but my review is past this. If you just look at it as a family in drama with chaos all around them (some clearly caused by them) and focus on the absolutely stunning performance by Sean Penn - and of course all the other big names then you take it for what it's worth, a unique movie with a steady dose of adrenaline, action, reality and just good filmmaking. I hope Penn wins an award because I haven't seen acting so well in a very long time.",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "The movie was slow but not in a bad way. It gets slower, than comes an action scene. The progress in the story never gets you bored. You literally feel what the characters feel. Every actor and actress did his job perfectly. But the trailer was misleading. I just thought this was all about revolution. Its the main goal in the movie ok but you dont feel that much.",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "At just shy of 3 hours, 'One Battle After Another' is compelling - and it keeps the viewer interested for the duration. This is a great achievement for such a long movie, as some movies of this length can tend to drag. That's not the case here - I found myself completely absorbed in the story within the first 10 minutes. And I stayed that way until the end. I just had to know what happened. While the plot is somewhat complicated, it's also a fascinating and multi-layered story that's weaved together in a clever manner that draws you in. And, while you need to pay attention, this does not detract from the experience at all. In fact, it makes it even better and all the more entertaining. The story centres on the activities of a group of modern-day revolutionaries known as 'the French 75', who leave all manner of destruction and chaos in their wake. In addition, the story explores the relationship between Bob - played by Leonardo DiCaprio - and fellow revolutionary Perfidia Beverly Hills, played by the talented Teyana Taylor. Taylor delivers a blistering performance as a rebel dedicated to her cause and brings a real intensity to the role. So much so that her energy almost emanates from the screen. Also at the centre of the story is Willa - played by Chase Infiniti. Willa is the daughter Bob shares with Perfidia. Then there's Sean Penn, who delivers a compelling performance as Colonel Steven Lockjaw, a military man dedicated in his relentless pursuit of the French 75. Villainous only begins to describe Penn's Colonel Lockjaw, as viewers also get to see a selfish man who will stop at nothing to get what he wants. Another great character is Sensei Sergio St. Carlos, played by Benicio Del Toro, who is absolutely fantastic. He lends an element of humour to the film, which serves to break the tension on many occasions. This includes one particularly funny scene where, having been pulled over by the police, he is forced to do a sobriety test. And of course, Di Caprio is brilliant in his role as a revolutionary, who is still a caring father that wants to protect his daughter from harm. Chase Infiniti also delivers a spectacular performance as Willa, a character who truly evolves over the course of the movie. The story takes place over (roughly) 15 - 20 years, so you get to see Bob evolve over time. You also get to see Willa as a teenager. This is an important aspect of the plot, so I won't say too much more on that. The various characters meet at several different times during the film, and each interaction is more and more unique. The supporting cast, including Colonel Lockjaw's soldiers, as well as protestors, and teenagers at a school dance, all deliver strong performances that provide the story with plenty of variety and intrigue. There are many themes explored in the film. For a start, you have corruption, racism, and rebellion against authority. Additionally, there is an exploration of the role secret societies play in maintaining what they believe to be 'balance' in the world. This last theme is particularly interesting and, while the society in this story has abhorrent values, this adds an extra layer to an already good story. While you don't always learn a lot about every character's background, the actors' performances more than make up for this, as does the intricate story telling. Plus, not knowing too much about the characters adds to the mystery around them. Additionally, it lends a gritty, almost bleak element to the story. Sometimes, not knowing and using your imagination is better than knowing a character too well, although that's just a personal view of mine. The film is well-paced too, with not a lot of down time. There's almost always a sense of 'what will happen next', as even when things seem steady, there's still an undercurrent of tension. There are also moments where you get to see characters' vulnerabilities and flaws. In my view, this adds to the appeal and depth of the movie. There is also a great soundtrack that matches the pace with the events on screen really well. The music is a little different to what you might see in more traditional action movies. But here it works like a charm. Additionally, there is amazing cinematography that captures the essence of the story - a struggle for power and a fight against corruption. Thanks to skilled editing, the multiple layers of the story are weaved together effortlessly. There's also a car chase toward the end of the movie that provides a unique take on this classic action film technique. The scene brings with it a quiet, yet focused intensity. Featuring a modern-day blue Mustang and white Dodge Charger, the colours of these vehicles - along with the roar of their V8 engines - complement the otherwise stark desert background perfectly. Plus, the cinematography during this scene - filmed on a deserted highway - is spectacular. During the sequence, the suspense builds and builds until one of the film's climactic scenes. One Battle After Another is unconventional, but in the best possible way. There are some plot twists that make the movie unpredictable, so you'll never be able to pick the ending. The combination of excellent direction - thanks to Paul Thomas Anderson - skilled editing, an excellent story, great cinematography, compelling performances and a unique soundtrack elevate this film from what could have been just another action movie to a fantastic film. When you see this movie, go to the cinema, it's well worth it.",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "Given the cast & director I was expecting good things from this movie. Happy to report that my expectations were well and truly met. A movie with great performances throughout, containing the right level of humour. I've always rated Sean Penn as an actor and sometimes I think people forget how great he has been throughout his career. Leo has truly moved away from playing the \"pretty boy\" many movies ago and do I need to say how great Benicio outside time and time again. I'm now curious if the Academy will notice this movie next year. Definitely far more deserving than The Smashing Machine in my opinion.",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "I saw 'One Battle After Another' last night, and I'm still not sure I get the hype. On paper, the film has everything: social commentary, action, radical politics, immigration, parenthood, even extremism. It tries to juggle so many weighty ideas at once - and I do applaud that - it's ambitious, topical, clearly trying to stir the pot. But ambition alone doesn't make for satisfying cinema, and this one ends up messy. At nearly three hours long, it's a slog when you still don't really know the people you're meant to care about. Not a single character feels grounded - Benicio del Toro aside (and even then, his screen time is frustratingly short). The rest make decisions that have zero logic in the absence of backstory, leaving them feeling exaggerated and hollow. So many talented actors, yet I wasn't rooting for anyone. The \"big message\" moments - racism, political division, systemic power, identity - land far too on the nose, skimming the surface without ever cutting deep. If I'm being fair, one thing I did love was the soundtrack - tense, pulsing, and full of nervous energy, it injects more urgency than the script ever does. But pace and tone overall are uneven. PTA's usual offbeat humour is basically MIA, and without it, long stretches drag and feel oddly dull. The film indulges its own grandeur, with sprawling chases and spectacle, but without clarity or cohesion. Honestly? It's his weakest film yet. It wants to be grand, relevant, provocative - and in parts it succeeds - but just doesn't hold it together. In the end, there's no clear overall message, just a lot of battles, one after another, that feel thrown at you without being stitched into something coherent.",
  "rating": 6,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "\"One Battle After Another\" is a gripping action thriller directed by Paul Thomas Anderson. Leonardo DiCaprio delivers a powerful, emotional performance as an ex-revolutionary fighting to save his daughter. Sean Penn is chilling as a ruthless official, and Benicio del Toro adds intensity as a former ally. Regina Hall and Teyana Taylor bring depth and heart. Anderson's direction is masterful, blending tension, stunning visuals, and a fitting score. A bold, thrilling, and deeply human film you don't want to miss.",
  "rating": null,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "This is the best movie of the year! It is a masterpiece in directing with a stellar cast and at least one sure-fire Oscar winner in Sean Penn. The previews were a bit misleading into giving me the impression this was an action movie (there are some action scenes) however this is a drama with black comedy elements. Despite that I was not disappointed... Paul Thomas Anderson has written and directed a fabulous film and gets stellar performances from DiCaprio, Penn, Benicio Del Toro, Teyana Taylor, Regina Hall and Chase Infiniti. Bob (DiCaprio) ha see left his radical days behind to be a father however his past is about to rear its ugly head. Bob's daughter (Infiniti) had grown into a teenager who has some idea what kind of people her parents used to be and is going to get a very real ideal of just how far her parents used to go for their ideals. Chase deserves an Oscar nod for her performance... Savvy, naïve, smart and vulnerable she turns in a tour de force performance. Director Anderson should get two nods- one for the script and another for the directing. At 2 hours and 41 minutes long this movie may test your bladder however it goes by at a nice pace and I didn't become bird at any point. Bravo to the entire cast and crew!",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "The title of my review is automatically going to be downvoted but it just represents exactly how I feel. This was a perfectly serviceable film that I was able to watch from start to finish and come out saying \"yeah it was fine.\" When it comes to any Paul Thomas Anderson film digging for a point and meaning to them is in my opinion a waste of time. You either connect with the characters and the surreal world that they live in, or you don't. Here I just didn't, I don't understand anything about what motivates the characters and only see surface level topics around immigration, racism and political revolution. For a PTA film the black humor is mostly absent, it is actually mostly played straight with a simple plot and nowhere near as much action as they are saying there is. I don't know who this was really made for because it seems too strange for wide audiences and too vanilla for PTA fans. Obviously some people say they love it and I'm not taking that away from you. But I fully expect the ratings on this film to normalize to an average film rating. If I'm wrong I'm glad audiences got something out of it.",
  "rating": 6,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "It seems people must be overly easily impressed giving this 9 or 10. Dont understand the hype. Its messy and just not that engaging. Its well made but its like a dish that smells and looks fantastic but tastes a bit bland. Difficult to say which ingredients are missing, but one thing that struck me from early on is I didnt really like or care about any of the characters. Many of them are just nasty, unlikeable. It couldnt seem.to make its mind up what it wanted to be, and many long scenes were pointless. The action wasnt anywhere near as insane as people say. The chase was good, but Bullett still has the best car chase of all time! It was a mixed bag. Often silly comedic at odd times, which wasnt very funny either. I felt like it has four or five writers all pulling it in different directions of action, thriller, dark humour, and not that great at any of it. It held me, but only just, and it does pick up after about an hour. I think if Id been on my own (my partner had the same review as me after) I may have walked, which I very rarely do\nI kept thinking it was like a try hard Rob Zombie/Tarantino/Scorcese movie but fell way short. I gave it 5, but its maybe a 6.5 at best.",
  "rating": 5,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "A breathtaking fusion of politics, love, thriller, and chaos. With stunning performances from Leonardo DiCaprio and Teyana Taylor, and powerful, multi-layered storytelling, it's a film that grips both your heart and mind. To truly feel its scale and emotion, watch it in theaters, preferably on an IMAX screen, where every frame explodes with meaning and intensity. The last 20 minutes had me on the edge of my seat. I could barely sit still from the tension. It was truly exhilarating.",
  "rating": 10,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "The first 20 minutes had me wondering how come it had such a good rating. But.... the more the movie progress the better it got and by the time it got to the last hour it was great. The soundtrack is great, it really makes you feel the tension in the scenes. The places where humor was used was subtle and effective. So aside from the confusing start, this is a must see movie!",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "Paul Thomas Anderson's One Battle After Another is a film that wants to be epic but ends up didactic. There's no denying its technical accomplishments: the cinematography is vivid, almost painterly at times, and Leonardo DiCaprio and Sean Penn deliver performances that are magnetic, commanding your attention even when the story falters. And falter it does. The film's ambition - to comment on political extremism - is undercut by its simplistic moral universe. One side of the conflict is portrayed as entirely evil, with no redeeming qualities or relatability. Every action they take is chaotic, violent, or manipulative, leaving the audience with no one to sympathize with on that side. This lack of nuance turns the movie from a story into a political lecture, making it feel less like cinema and more like ideological instruction. In a moment when America feels more divided than ever, the timing of such a film is jarring. Its portrayal of chaos and extremism is so stark that it risks being taken too seriously by audiences at either extreme, rather than prompting reflection. More troublingly, it underscores how out of touch Hollywood can be with most Americans, presenting a world of ideological extremes that few viewers would recognize in real life. Still, the film isn't without merit. Anderson's eye for detail, his visual inventiveness, and the sheer force of DiCaprio and Penn's performances make it watchable even when it preaches. But for a director capable of deep, character-driven storytelling, this attempt at political commentary feels like a missed opportunity.",
  "rating": null,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "'One Battle After Another' is true to its name in every aspect and serves as a deliberate attempt at topical commentary on the radical nature of war wrapped in a revolutionary tale of freedom. Strong performances all around, including DiCaprio's 'Bob Ferguson' and Penn's 'Steven J. Lockjaw' leading the charge with standout performances that chewed the scenery at every opportunity. The score at times comes in with a dramatic punch yet knows how to dial it back through bouncy percussion and helps in creating tense, lofty, and poignant character moments. Occasionally, the runtime can be felt with the film slowing down and taking its time to breathe, but the majority of the film is paced with precision and never feels like a tedious watch. Thematically resonant, the subject matter throughout is grounded, complex, yet still has a sense of simplicity that can sometimes create a tonal dissonance in parts of its satirical nature. The modernization of filmmaking here is truly something to behold and Director Paul Thomas Anderson surely adds a great dimension to his illustrious career with this level of cinematic storytelling. Taking every sudden turn with undying conviction, 'One Battle After Another' is a fury of social commentary with a fitting cast of intricate characters and sees past its distractions to become a thoroughly engaging and prevalent theatrical experience.",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "The film is in the cover of 80s' west movie. You can see some distinct features of southwest. Some shots of the film may remind you of Sicario, especially these blue moments of the boundary of us and mexico. However, the seemingly old school images tells a extremely btutal even explicit real life story. From the lines causally slipped out of characters's mouth, we can see the paradoxical outcomes of the current world, reminding us the crucial nature of mankind.",
  "rating": 8,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "A message louder than the movie",
  "rating": 6,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "Don't take the trailer for what this movie is. It is NOT an action movie. It is a pure character driven movie where pretty much ALL the characters shine. They are portrayed as very human, very flawed, not caricatures or tropes. I'd say what stood out for me the most was Sean Penn's performance. Dude absolutely nails it. I've never thought of Sean Penn as intimidating, but he nails it here. If you're expecting DiCaprio to go in guns blazing saving everyone, this ain't it. His performance is also TOP notch here as a washed-out has been pretty much powerless in the face of a crushing adversary. Yet he still decides to face everything head on. Like Caught Stealing is pure Aronofsky and not an action movie, so too is One Battle After Another a pure Paul Joseph Anderson flick.",
  "rating": 8,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "I really didn't expect to write a review, but the amount of PTA bots calling this movie a masterpiece made me say two or three things. I think it's a perfectly solid movie, it looks good, the pace is okay, the actors are perfectly talented but not used to their full potential. The script is what lowers the quality and impression of this movie because the jokes are cringe or better said cheap and predictable. But okay jokes aside, what's missing the most is a deeper dive into the characters and their relationships, who they are and why they do the things they do, but everything remains kind of surface level, unfinished, which results in me simply not caring about these characters. The action is nowhere near as crazy as they want you to think and the music, although great, is a bit too distracting at times. I'll conclude this review because I have nothing to say except that it's a perfectly solid movie but pls don't expect a masterpiece just because a big director's name is attached to it.",
  "rating": 6,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "What is this movie about? It starts with the \"French 75\", a group with ideolical goals. Their rebellion changes nothing and their members soon end up in jail. This is portrayed without obvious moral underlining. The other half of the Paul Thomas Anderson movie is a family drama. That's also when the video editor decided to continue his work on an old VCR device. We get to see intense emotions, wild car chases and a few comedic performances. At the end there is a hardly character devolpment to be witnessed. One of the main characters pretty much stays the same. It's a shame, that this film lacks a clear continuity storywise. The formula follows the modern storytelling: intense emotions replace a stunning script. Of course, the cinematography is high standard, outstanding and well crafted. Yet the movie was not convincing. No rewatch planned. Try harder next time.",
  "rating": 5,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "A heavy, heavy film. It starts out as one thing and ends up another (no spoilers here). A convoluted plot (sort of), really well written, thoughtful Direction, and excellent acting, all make for an absorbing film - although whether the word \"enjoyable\" is applicable, is a moot point. DiCaprio and Penn rightly star, and are excellent. Taylor and McHayle are also very good - the rest of the cast are effective too. This film starts as, potentially, a political thriller, but ends up as a commentary on relationships (isn't everything?). Given the current volatility of the American political landscape it's easy to read reflections of current events into this film (although made a year or two ago), whilst this is tempting, I don't think it helps - and could distract. The main characters could be seen as good v bad, but it's not that simple, motivations are complex and none of the characters come out from this film as innocent (maybe, with one exception). I liked the fact that this is a nuanced and complex story - a film where you need to pay attention (curses on those who double screen at the cinema). Having said the word enjoyable can't be applied to this film, in retrospect it is thoroughly entertaining and worth seeing - something different.",
  "rating": 8,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
},
{
  "movie_id": "tt30144839",
  "movie_title": null,
  "review_title": null,
  "review_text": "I really liked this movie. To me, it was well crafted and didn't rely on gratuitous violence, foul language, and absurdity to tell a story. The attention to detail and cinematography was top shelf. Do they give Oscars for set and prop execution? The beauty is in the details as we follow Leo on this two and half hour journey. The film is authentic and approachable without missing any Hollywood glamor. And while it is long, it is seamless and without technical fault. And at times it is mesmerizing, reflective art. The car \"chase\" is as suspenseful as any over the top chase, if not more so, and shot with artists and a new approach. The movie is simply beautiful in the small and the large ways. The characters are relatable and for such a simple film, they are interesting and dare I say complex to a certain extent. There isn't a character in here that isn't interesting. This a testament to good writing, good acting, and good direction...and good casting. My favorite in some ways was Benicio Del Toro who brings calm and down to earth grounding to an anxiety inducing middle of the movie, along with some low key humor. He's a good friend to all, and that makes a great character, beer in hand. Chase Infiniti does a fantastic job acting, brining a strong performance to the big screen. Leo brings his usual great acting, and his character has humor that is authentic and would be hard not to embrace. And Sean Penn provides a master class in odd ball behavior and method acting. This is easily a 8/9 out of 10 and should have good re-watch ability.",
  "rating": 9,
  "reviewer": null,
  "review_date": null,
  "source": "imdb"
}
]